[{"author":"Verlyrus","authorImage":"www.dragonfable.com/images/mini/Verlyrus.png","date":"February 11, 2018","link":"www.dragonfable.com/gamedesignnotes/weekend-fixes-6749","title":"Weekend Fixes: Small Update","text":"Hey there, Heroes!</p>\n<p>Just a small weekend bug fix round!</p>\n<p>Fixed: Immobility resistance broke in Friday's release and wasn't working. Immobility resist works properly now.<br />Adjusted: Shadow and Ancient Shadow Base Classes no longer require you to be the same base class in order to equip or save in the armor closet.<br />Fixed: Void enemies in Embrace Your Destiny and Know Your Nature no longer do \"undefined\" damage with their DoT effects.</p>\n<p>That's all!</p>\n<p>Thank you for playing, and hope you all have had, and continue to have, wonderful weekend!</p><p><br />","imageLinks":[]},{"author":"Verlyrus","authorImage":"www.dragonfable.com/images/mini/Verlyrus.png","date":"February 09, 2018","link":"www.dragonfable.com/gamedesignnotes/the-apprentice-6748","title":"Six Heroes: The Apprentice!","text":"Heya! It’s <strong>Aeon</strong> again—back with some more design notes regarding this week’s quest.</p>\n<ul>\n<li>The ending of the last quest (The Burning Village) was originally part of this script, but I moved it back so you’d know about the enemy sooner, not later.</li>\n<li>“Return to Lymcrest” takes place several weeks after “The Burning Village.” This quest happens right after that.</li>\n<li>The little critter cameo is a callback to the early days of DF. If you don’t know what I’m talking about, see “Olaf’s Party” in Book 1 Dragesvard. The style of humor in that quest is really one of DF’s hallmarks.</li>\n<li>The first thing the Hero teaches Falwynn in this quest: what number lesson do they start with?</li>\n<li>Of all the quests in this arc, this was my favorite one to write. The atmosphere is silly and the dialogue flows smoothly—it’s just a cute quest overall.</li>\n</ul>\n<p>And since this week focuses on Falwynn, here’s some trivia about her:</p>\n<ul>\n<li>Her birthday is April 7th (<em><strong>based on our calendar, not the in-game one!</strong></em>).</li>\n<li>Her favorite color is ultraviolet, a color she can’t even see. Her next favorite is green.</li>\n<li>She was based on Linkle, a character from The Legend of Zelda series.</li>\n</ul>\n<p>That’s all for this week! Again, thanks for reading—and see you next time!</p>\n<p>Head over to <strong>Book 3 Falconreach</strong> and talk to <strong>Ash</strong> to continue the <strong>Six Heroes Saga</strong>!</p>\n<p><img src=\"https://cms.aqworlds.com/df/images/09-02-2018.png\" alt=\"\" width=\"399\" height=\"239\" /></p>\n<hr />\n<p>Hey there heroes!</p>\n<p>Verlryrus here with a bunch of fixes and changes going live this week.</p>\n<p>Fixed: \"Magic\" dragon feeding in Bk1 Celestia's Grove numbers not appearing properly.<br />Fixed: Stealth Lovey Bear in new Sir Jing's Weapons quest.<br />Fixed: Mutant Caves; issue with final room when map generated a certain way.<br />Fixed: Fallen Ice Dragon weapons now have properly functioning specials.<br />Fixed: Jova's weapons now have properly functioning specials. <br />Adjusted: Jova's weapons bonus damage normalized to +30% (from +50%), in line with Fallen Ice Dragon and Escelence DC items.</p>\n<p>Adjusted: Riftwalker's Fade now gives M/P/M defense instead of B/P/D avoidance.<br />Fixed: Riftwalker's Fade now properly gives 2 turns of damage boost (was incorrectly giving only 1).<br />Fixed: GPS MkII now has skill descriptions for Burn and Selfdestruct.<br /><br />Adjusted: Hard Mode enemies no longer have an innate 20% chance to ignore stun/immobility effects.<br /><br />Adjusted: Zard Cuisine from the Zardbie war (Mogloween Book accessible).<br />    Tartare: 20% Boost for 5 turns<br />    Legs: Crit +50 (25%) for 5 turns<br />    Cakes: LUK + 40 for 5 turns<br />    Kebobs: Bonus +100 for 5 turns<br />    All: Stuffed for 30 turns (up from 5)<br /><br />Adjusted: Arena at the Edge of Time gold rewards significantly increased for the following challenges:<br />    Dragonoid<br />    Siofra<br />    Theano<br />    Elemental Chaos<br />    Centaur Abomination<br />    Cauldron Groupies<br />    Jack Crescent (and Guitar)<br />    Legion Crawler<br />    Crawler & Centaur<br />    Random Blood Moon Challenge<br />    Sir Bearginion, Most Honorable Duelist of the Western Deepwoods, Also Known As One Punch Bear<br />    Leorilla<br />    Weird Duo<br />    Super Sentog Justice Go!<br />    Groundhog Dave<br />    Big & Small</p>\n<p>Adjusted: All \"final tier\" challenges now cost 1000 gold to attempt. This includes:<br />    Elemental Chaos<br />    Triple Trouble<br />    Random Blood Moon Challenge<br />    Crawler & Centaur<br />    Weird Duo<br />    Big & Small<br /><br />Armor Closet:<br />Fixed: Ancient Shadow Base Classes now load properly from the bank.<br />Adjusted: Some Armor Closet text.<br />Adjusted: GPS v1.0 now has a separate entry.<br />Adjusted: Certain Armors no longer appear in the Armor Closet unless you have them:<br />    Calendar Classes<br />    Ancient Shadow Base Class<br />    DoomKnight V1<br />    GPS v1.0</p>\n<p>More big things to come next week!</p>\n<hr />\n<p>Excited about what happens next in the story? Is Falwynn really the best apprentice hero ever?</p>\n<p><a href=\"http://forums2.battleon.com/f/tt.asp?forumid=89\">Join the discussion on the official forums!</a></p>\n<p>Be sure to follow us on Twitter for occasional sneak peeks and discussions!</p>\n<p><a href=\"https://twitter.com/VerlyrusAE\">Verlyrus Twitter</a></p>\n<p><a href=\"https://twitter.com/TomixDF\">Tomix Twitter</a></p><p><br />","imageLinks":["https://cms.aqworlds.com/df/images/09-02-2018.png"]},{"author":"Verlyrus","authorImage":"www.dragonfable.com/images/mini/Verlyrus.png","date":"February 02, 2018","link":"www.dragonfable.com/gamedesignnotes/big-and-small-challenge-6737","title":"The Big and Small Challenges Have Arrived!","text":"Hey there, Heroes!</p>\n<p>This week in DragonFable, we have some very special visitors to the Arena at the Edge of Time!</p>\n<p><img title=\"bignsmall\" src=\"https://cms.aqworlds.com/df/images/02-02-2018.png\" alt=\"bignsmall\" width=\"400\" height=\"240\" /></p>\n<p>First up, the Super Sentog Justice Go! team, supertogs from another timeline, are here to face you in combat! Can you take all five of them down?</p>\n<p>Sentog Red is quick to anger, and has a firey personality. His favorite food is curry!</p>\n<p>Sentog Yellow is the smartest of the group! She's got a stunning wit!</p>\n<p>Sentog Blue loves to swim, and is hard to catch! She's been voted the prettiest sentog 5 years running!</p>\n<p>Sentog Green is fast! Watch out for his quick strikes. He likes to run outside!</p>\n<p>Sentog Black is mysterious. He's very handsome, but what secrets could he be hiding?</p>\n<p>Next, we have Groundhog Dave.</p>\n<p>We're not entirely sure where he comes from. He appears to have the ability to control time within a period of two weeks. And he's also a very large groundhog. I'm sure everything will be fine. Just try not to stand in his shadow for too long.</p>\n<p>Defeat them to earn the Sentog Helm and Groundhog Wings for your very own.</p>\n<p>Head over to the Inn at the Edge of Time and do your best!</p>\n<hr />\n<p>Having trouble with the fights? Have a strategy you want to share? Want to discuss the implications of the existence of a world where togs are superheroes? Is Groundhog Dave his REAL name?</p>\n<p><a href=\"http://forums2.battleon.com/f/tt.asp?forumid=89\">Join the discussion on the official forums!</a></p>\n<p>Be sure to follow us on Twitter for occasional sneak peeks and discussions!</p>\n<p><a href=\"https://twitter.com/VerlyrusAE\">Verlyrus Twitter</a></p>\n<p><a href=\"https://twitter.com/TomixDF\">Tomix Twitter</a></p><p><br />","imageLinks":[]},{"author":"Verlyrus","authorImage":"www.dragonfable.com/images/mini/Verlyrus.png","date":"January 26, 2018","link":"www.dragonfable.com/gamedesignnotes/sir-jing-reimagined-6726","title":"Sir Jing's Weapons: Reimagined","text":"Hey there, heroes!</p>\n<p>This week in DragonFable, we've revisited an old quest from the early days of DragonFable and given it a complete makeover!</p>\n<p><img title=\"sirjing\" src=\"https://cms.aqworlds.com/df/images/26-01-2018b.png\" alt=\"sirjing\" width=\"400\" height=\"240\" /></p>\n<p>Find the two knights messing around with a catapult in Oaklore (Book 1 or Book 3), and ask them about Sir Jing, then trek your way through the storm to earn powerful items!</p>\n<p>This is the first in DragonFable's \"Reimagined\" series, where every month, we'll try to do a release where we revisit old content and modernize it. Let us know if there are any old quests that you'd like to see reimagined!</p>\n<p>Also this week, the sounds of combat have been changed up. Every element now has a unique sound, and most have gotten new sounds added. We'd love to hear your feedback about that as well!</p>\n<hr />\n<p>Have a quest you want to see reimagined? Have feedback about new sounds? Want to chat about all things DragonFable? Join us on the official forums and follow us on twitter!</p>\n<p><a href=\"http://forums2.battleon.com/f/tt.asp?forumid=89\">Join the discussion on the official forums!</a></p>\n<p><a href=\"https://twitter.com/VerlyrusAE\">Verlyrus Twitter</a></p>\n<p><a href=\"https://twitter.com/TomixDF\">Tomix Twitter</a></p><p><br />","imageLinks":[]},{"author":"Tomix","authorImage":"www.dragonfable.com/images/mini/Tomix.png","date":"January 19, 2018","link":"www.dragonfable.com/gamedesignnotes/three-questions-6713","title":"Three Questions","text":"<span style=\"color: #ffcc00;\">The next quest of the main story is here!</span></p>\n<p><span style=\"color: #ffcc00;\">Lynn has invited you to her home for a tea party! (<em>what's up with little girls and tea parties anyway...?</em>)</span></p>\n<p><span style=\"color: #ffcc00;\">While you are on your way, other events are taking place. The wheels are turning. The ball is rolling. The... you get the idea!</span></p>\n<p><span style=\"color: #ffcc00;\">Head over to Kara in Sulen'Eska and continue Book 3!</span></p>\n<p><img src=\"https://cms.aqworlds.com/df/images/19-01-2018.png\" alt=\"\" width=\"400\" height=\"240\" /></p><p><br />","imageLinks":["https://cms.aqworlds.com/df/images/19-01-2018.png"]},{"author":"Tomix","authorImage":"www.dragonfable.com/images/mini/Tomix.png","date":"January 12, 2018","link":"www.dragonfable.com/gamedesignnotes/a-new-student-6702","title":"A New Student!","text":"<span style=\"color: #ffcc00;\">The Thorns quest chain continues!</span></p>\n<p><span style=\"color: #ffcc00;\">After Belle miraculously survived the manaphages, the hero suggested to take her to an old friend.</span></p>\n<p><span style=\"color: #ffcc00;\">Let's see if this mysterious person (it's totally Warlic, come on!) can uncover what secrets hide in Belle's body!</span></p>\n<p><img src=\"https://cms.aqworlds.com/df/images/12-01-2018.png\" alt=\"\" width=\"399\" height=\"239\" /></p><p><br />","imageLinks":["https://cms.aqworlds.com/df/images/12-01-2018.png"]},{"author":"Verlyrus","authorImage":"www.dragonfable.com/images/mini/Verlyrus.png","date":"January 05, 2018","link":"www.dragonfable.com/gamedesignnotes/otherworldly-challenge-part-1-6695","title":"The Otherworldly Challenge Has Arrived!","text":"Happy New Year, Heroes!</p>\n<p>Hope everyone is staying warm! A new page of challenges has appeared on the arena board in the Inn at the Edge of Time! The Otherwordly Challenges have begun- pitting you against mysterious beasts and creatures the likes of which have never before been seen on Lore!</p>\n<p><img title=\"Otherworldly\" src=\"https://cms.aqworlds.com/df/images/05-01-2018v2.png\" alt=\"Otherworldly\" width=\"400\" height=\"240\" /></p>\n<p>See! The proud and mighty Leorilla! It is quick to anger- beware his watchful gaze!</p>\n<p>See! The legendary Sir Bearginion the Third, Most Honorable Duelist of the Western Deepwoods, AKA One Punch Bear, AKA, Your Doom! Face him in a 1v1 honorable duel! Try anything funny and you may find out why they call him \"One Punch Bear\"!</p>\n<p>Earn! The mighty Leorilla Mane Belt, a grand trophy for a grand fight! (Note, no Leorillas or bears were harmed in the making of Leorilla Mane Belts. Really.)</p>\n<p>Challenge them today in the Inn at the Edge of Time!</p>\n<hr />\n<p>In other news, ShadowWalker of Time accessories are now available from the Book of Lore and Cysero's Superstore of Savings!</p>\n<p><img title=\"SWoT\" src=\"https://cms.aqworlds.com/df/images/05-01-2018.png\" alt=\"SWoT\" width=\"400\" height=\"240\" /></p>\n<p>Get that fancy hair/helm, as well as two different matching weapons! When the shop is removed from the Book of Lore, the items will still be available from Cysero's Superstore, so don't worry!</p>\n<hr />\n<p>Having trouble with the challenge fights? Have any ideas what these strange new foes are or where they could have come from?</p>\n<p><a href=\"http://forums2.battleon.com/f/tt.asp?forumid=89\">Join the discussion on the official forums!</a></p><p><br />","imageLinks":[]},{"author":"Verlyrus","authorImage":"www.dragonfable.com/images/mini/Verlyrus.png","date":"December 29, 2017","link":"www.dragonfable.com/gamedesignnotes/gifts-and-snow-6686","title":"Frostval Gifts and Snow!","text":"Hey there, heroes!</p>\n<p>Hope everyone has had a superb holiday season!</p>\n<p>This week, your Frostval gifts are opening... bringing a double artifact set for Frost Moglin armor that more than doubles its chance to grow the Spirit of Giving!</p>\n<p>Oh, it also changes the way the armor looks. Become a Frost Moglin Knight!</p>\n<p><img title=\"FMK\" src=\"https://cms.aqworlds.com/df/images/29-12-2017.png\" alt=\"FMK\" width=\"400\" height=\"240\" /></p>\n<p>Also, snow has finally fallen over Falconreach. Enjoy the snow while it lasts!</p>\n<p>Happy New Year from the DragonFable team! Thank you for playing, and here's to another awesome year!</p><p><br />","imageLinks":[]},{"author":"Tomix","authorImage":"www.dragonfable.com/images/mini/Tomix.png","date":"December 22, 2017","link":"www.dragonfable.com/gamedesignnotes/frostval-finale-6680","title":"Frostval 2017 Finale!","text":"<span style=\"color: #335566;\"><strong>Happy Frostval everyone!</strong></span><br /><br /><span style=\"color: #335566;\">This last week before the holidays seems to always be a rush one way or another. I look around and everywhere I see people frantically going about: final desperate preparations for final exams, tripidating plannings for trips for the holidays, anticipation for friend and family gatherings left, right, up, down and everywhere in between.</span><br /><br /><span style=\"color: #335566;\">Speaking of family gatherings, have you ever had that one family member who is always in the worst of moods while everyone is trying to have a good time? If you have, Moroz might feel a bit familiar. One would think that after all the effort the Hero and co. have gone through to accommodate him he could warm up a bit… Is it the fact that they are all strangers? Possibly… The fact you showed up uninvited? Maybe but still… Is there something else that that's riling Moroz? Doesn't seem so. He really seems unnecessarily sour. Sour as an unripened moglinberry.</span></p>\n<p><span style=\"color: #335566;\"> </span><img src=\"https://cms.aqworlds.com/df/images/22-12-2017.png\" alt=\"\" width=\"399\" height=\"239\" /><br /><br /><span style=\"color: #335566;\">All in all perhaps he is just a lumberjack through and through: as sharp as the blade of his axe and as stiff as the bark of the trees he cuts down all at the same time.</span><br /><br /><span style=\"color: #335566;\">For those full of impatience and expectations for a white Falconreach, Snowy Falconreach will come in January as Verly and Tomix get a bit of rest for the epic job they have done on releases this year!</span><br /><br /><span style=\"color: #335566;\"><em>I’m dreeeaming of a white Frostvaaal…</em></span><br /><br /><span style=\"color: #335566;\">Have fun and enjoy the holidays!</span></p>\n<p><span style=\"color: #335566;\"><strong>~Elryn</strong></span></p>\n<p> </p>\n<hr />\n<p><span style=\"color: #ffcc00;\">Hey guys, Tomix here.</span></p>\n<p><span style=\"color: #ffcc00;\">Unfortunatelly I was not able to finish up snowy Falconreach this week... so it'll be coming out at a later date, very soon!</span></p><p><br />","imageLinks":["https://cms.aqworlds.com/df/images/22-12-2017.png"]},{"author":"Verlyrus","authorImage":"www.dragonfable.com/images/mini/Verlyrus.png","date":"December 15, 2017","link":"www.dragonfable.com/gamedesignnotes/frostval-2017-6669","title":"Frostval 2017 is here!","text":"Hey there, Heroes!</p>\n<p>Verlyrus here! Frostval has arrived to Lore yet again, and it's time to celebrate. Unless something were to go wrong...</p>\n<p>Chapter 12 of the Frostval book is now available.</p>\n<p><img title=\"Trouble in the Woods\" src=\"https://cms.aqworlds.com/df/images/15-12-2017.png\" alt=\"Trouble in the Woods\" width=\"400\" height=\"240\" /></p>\n<p>And a word from Elryn about this year's quests:</p>\n<p><span style=\"color: #335566;\">It's that time of year again!</span></p>\n<p><span style=\"color: #335566;\">Frostval is right around the corner and the Frost Moglins are gearing up their village for the celebrations!</span></p>\n<p><span style=\"color: #335566;\">Everything seems just about ready to go but something... feels missing. Warm bonfire to huddle around? That's there. Hot cocoaberry juice to drink with everyone? Nope. That's there too... Decorated trees full of Frostval spirit? Th-</span></p>\n<p><span style=\"color: #335566;\">Wait.</span></p>\n<p><span style=\"color: #335566;\">No trees... Where are the moglins that went out to get them?</span></p>\n<p><span style=\"color: #335566;\">Sounds like there might be trouble in this neck of the woods... I hope you brought your snow shoes!</span></p>\n<p><span style=\"color: #335566;\"> </span></p>\n<hr />\n<p><span style=\"color: #ffffff;\">This week's quest drops some special gifts too!</span></p>\n<p><span style=\"color: #ffffff;\">On another note- some engine updates and bug fixes!</span></p>\n<ul>\n<li><span style=\"color: #ffffff;\">ShadowWalker of Time is officially released! Major bugs have been ironed out, and the class is finally ready.</span></li>\n<li><span style=\"color: #ffffff;\">Fixed a nasty bug where buffs would be removed 1 turn before they are supposed to be, but still had stat effects.</span></li>\n<li><span style=\"color: #ffffff;\">The story summary in the Book of Lore no longer closes the Book of Lore when you're done reading it.</span></li>\n<li><span style=\"color: #ffffff;\">Fixed an issue where Twilly would hand out old dragons instead of new ones.<br /></span></li>\n</ul>\n<p><span style=\"color: #ffffff;\">That's all for this week!</span></p>\n<p><span style=\"color: #000000;\"> </span></p>\n<hr />\n<p>What could come out of the presents this year? Will you be able to save Frostval yet again? Want to discuss lore? Anything else  DragonFable related?</p>\n<p><a href=\"http://forums2.battleon.com/f/tt.asp?forumid=89\">Join the discussion on the official forums!</a></p><p><br />","imageLinks":["/images/amulet/get-your-dragon-amulet.jpg","/images/amulet/earn-free-dragoncoins.jpg","/shared/images/network/AQ3D-MoglinEars.jpg","/shared/images/network/calendar2017small.jpg","/shared/images/network/biobeasts-legacy-side.jpg","/shared/images/network/AQD-Banner-Tall-AQ5.jpg","/shared/images/network/2018-calendar-legacy1.jpg","//pixel.quantserve.com/pixel/p-effgxc39LuLj2.gif","http://b.scorecardresearch.com/b?c1=8&c2=6035824&c3=1271511541440202500&c4=&c5=&c6=&c15=&cv=1.3&cj=1"]}]